backend/modules/user/controllers/DefaultController.php

SELECT * FROM `ccoa_user` WHERE `id`='10'
---
    private function findModel($id)
    {
        if(($model = User::findOne(['id'=>$id])) !== null)