common/models/User.php

    public static function findIdentity($id)
    {
        return self::findOne(['id'=>$id,'STOP'=>  self::STATUS_ACTIVE]);
---
SELECT * FROM `ccoa_user` WHERE (`id`='a900761e88f648763ea19f80b0d41563') AND (`status`=10)