common/wskeee/rbac/models/searchs/AuthItemSearch.php

SELECT * FROM `ccoa_auth_item` WHERE `type`=2
---
    public function search($params)
    {
        /* @var yii\rbac\AuthManager $authManager */
        $authManager = Yii::$app->authManager;
        if($this->type == Item::TYPE_ROLE)
            $items = $authManager->getRoles();
        else
            $items = $authManager->getPermissions();

        if($this->load($params) && $this->validate() && (trim($this->system_id)!=='' || trim($this->name)!=='' || trim($this->description)!==''))