backend/modules/team/controllers/TeamController.php

    protected function findModel($id)
    {
        if (($model = Team::findOne($id)) !== null) {
---
SELECT * FROM `ccoa_team` WHERE `id`='4'