backend/modules/news/controllers/DefaultController.php

SELECT * FROM `ccoa_system` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = System::findOne($id)) !== null) {