backend/modules/multimedia/controllers/ContenttypeController.php

SELECT * FROM `ccoa_multimedia_content_type` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = MultimediaContentType::findOne($id)) !== null) {