backend/modules/multimedia/controllers/ProportionController.php

    public function actionCreate($content_type)
    {
        if($this->getIsExistenceTargetMonth($content_type))
            throw new NotFoundHttpException('在同一个月份请勿重复创建比例！');

        $model = new MultimediaTypeProportion();
        $model->target_month = date('Y-m', time());
        if ($model->load(Yii::$app->request->post()) &&  $model->save()) {
---
INSERT INTO `ccoa_multimedia_type_proportion` (`target_month`, `content_type`, `proportion`, `created_at`, `updated_at`) VALUES ('2016-09', 2, '50', 1474610054, 1474610054)
SELECT 1 FROM `ccoa_multimedia_type_proportion` WHERE `target_month`='2016-09'

    protected function findModel($id)
    {
        if (($model = MultimediaTypeProportion::findOne($id)) !== null) {
---
SELECT * FROM `ccoa_multimedia_type_proportion` WHERE `id`='27'

    public function getContentType()
    {
        $contentType = MultimediaContentType::find()->all();
---
SELECT * FROM `ccoa_multimedia_content_type`

    public function getIsExistenceTargetMonth($contentType)
    {
        $proportion = MultimediaTypeProportion::findAll(['content_type' => $contentType]);
---
SELECT * FROM `ccoa_multimedia_type_proportion` WHERE `content_type`='2'