common/wskeee/rbac/models/AuthItem.php

    public function save()
    {
        if($this->validate())
        {
            if($this->_item === null)
            {
                if($this->type == Item::TYPE_ROLE)
                    $this->_item = $this->authManager->createRole($this->name);
---
INSERT INTO `ccoa_auth_item` (`name`, `type`, `description`, `rule_name`, `data`, `created_at`, `updated_at`) VALUES ('p_multimedia_task_create_check', 2, '多媒体-任务添加审核', NULL, NULL, 1474445590, 1474445590)